InformationRegisters/ИзмененныеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИзмененныеОбъекты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:TaskRef.Мероприятие</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененныеОбъекты/Forms/ФормаИзменений/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект = Параметры.Объект;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИзмененныеОбъекты.Сообщение
	                      |ИЗ
	                      |	РегистрСведений.ИзмененныеОбъекты КАК ИзмененныеОбъекты
	                      |ГДЕ
	                      |	ИзмененныеОбъекты.Объект = &Объект
	                      |	И ИзмененныеОбъекты.Сотрудник = &Сотрудник");
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Сотрудник", УдалитьОбщегоНазначения.ТекущийПользователь());	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Нов = Таблица.Добавить();
		Нов.Дата = Дата(Лев(Результат.Сообщение, 14));
		
		Стр = Сред(Результат.Сообщение, 9);
		Ном = Найти(Стр, ";");
		Нов.Изменил = Лев(Стр, Ном - 1);
		
		Стр = Сред(Стр, Ном + 1);
		Стр = СокрП(СтрЗаменить(Стр, "|", Символы.ПС));
		Нов.Описание = Стр;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Отказ = Ложь;
	ОбъектыСервер.УдалитьПометкуОбИзменении(Отказ, Объект);
	Если Не Отказ Тогда
		Таблица.Очистить();
	КонецЕсли;
КонецПроцедуры
